
public class Questions {
	String[][] answers={
	        {"Καλυψώ "," Κίρκη"," Αφροδίτη " }, 
	        { " Ήφαιστος ", " Άρης "," Ποσειδώνας " },
	        { "'Ηλιος",  "Ποσειδώνας"," Δίας" }, 
	        {" Φήμιος "," Δημόδοκος", "Αντίνοος"}, 
	        {"τον Κέρβερο"," τον Κένταυρο", " τον Ερύμανθο "},
	        {"  Αιγέας "," Αγαμέμνων", "Δαίδαλος"},
	        {"Πρωτεσίλαος"," Φιλοκτήτης", "Τεύκρος" } ,
	        {"Ισμήνη ","Ιοκάστη ",  "Ελένη "}, 
	        {"Βρισηίδα " ," Χρυσηίδα" , "Ανδρομάχη" }, 
	        {" ΄Ατλας", "Προμηθέας ", "Επιμηθάες" } , 
	        { "Στην Κνωσσό" , "Στην Τροία", "Στον Εύρωμο" },
	        {" Σε εννέα" ,"Σε πέντε" , "Σε δύο" }, 
	        {"1250-1240 π.Χ ","1500-1490 π.Χ " , "1100-1090 π.Χ" }, 
	        {"Στον Ευριτίωνα και τον Όρθρο" ,"Στον Μενοίτιο και τον Άδη" }, 
	        {" Η θεά Ήρα" ,"Η θεά Δήμητρα" , "Η θεά Αφροδίτη" }, 
	        {"Για να πάρουν το χρυσόμαλλο δέρας" ," Για να φέρουν εις πέρας τρεις άθλους ", "Ήταν διαταγή του Πελία" },
	        {" Είχε κεφάλι λιονταριού, ουρά φιδιού και σώμα κατσίκας","Είχε κεφάλι φιδιού, ουρά σκύλου και σώμα κατσίκας " , "Είχε κεφάλι ταύρου, ουρά λιονταριού και σώμα κατσίκας" },
	        {"Στο Ιδαιό Άντρο " ,"Στη Φαιστό " , "Στην Τροία " },
	        {"Η τρίαινα" ," Τα φίδια" ,"Τα σπαθιά "}, 
	        {"Ο Οδυσσέας","Ο Θησέας", "Ο Ιάσονας"  },
		
		//sviste to meta to egrapsa gia na mhn xathw
	        
		/*1*/ {"Ερύμανθος", "Όλυμπος", "Πίνδος", "Ίδη"},
		/*2*/ { "Ιφικλής" , "Αππελής" , "Ετεοκλής", "Ετοιμοκλής"},
		/*3*/ { "Το λιοντάρι της Νεμέας", "Οι Στυμφαλίδες όρνιθες", "Η Λερναία Ύδρα", "Οι στάβλοι του Αυγεία"},
		/*4*/ { "Ανδρομάχη", "Αριάδνη", "Ανδριανή", "Αντιόπη"},
		/*5*/ { "Ήρα", "Δίας", "Απόλλωνας", "Διόνυσος"},
		/*6*/ { "Ίκαρος", "Θησέας", "Ιάσων", "Ίφιτος"},
		/*7*/ { "με ρόπαλο", "με βέλη", "με σπαθί", "με κοντάρι"},
		/*8*/ { "Της Αυλίδας","Του Ναυπλίου" , "Του Βόλου", "Του Πειραιά"},
		/*9*/ { "Αργώ", "η Ιωλκός", "Γοργώ", "Ινώ"},
		/*10*/ { "Νέστορας", "Ιδομενέας", "Αίαντας", "Διομήδης"},
		
		/*11*/ { "Ερμής", "Αππόλων", "Πλούτωνας", "Διόνυσος"},
		/*12*/ { "Ορφέας", "Θησέας", "Ιάσονας", "Ηρακλής"},
		/*13*/ {"Λητώ", "Δανάη", "Αντιόπη", "Σεμέλη"},
		/*14*/ {"Οιδίποδας", "Ηρακλής", "Οδυσσέας", "Κρέοντας"},
		/*15*/ {"Άρτεμις", "Λητώ", "Ήρα", "Δήμητρα"},
		/*16*/ {"γουρούνια","λιοντάρια","αγελάδες", "κριάρια"},
		/*17*/ {"Απόλλων", "Δίας", "Ερμής", "Διόνυσος"},
		/*18*/ {"Άργος", "Φρίξος", "Ναύπλιος", "Εύμαιος"},
		/*19*/ {"Αίγισθο", "Έκτορα", "Πάρη", "Αχιλλέα"},
		/*20*/ {"Κρόνος", "Ουρανός", "Άτλαντας", "Ιαπετός"}
		
	             };
	
	  String[] qs = { "Στο νησί ποιας θεάς φιλοξενήθηκε ο Οδυσσέας για επτά χρόνια καθώς προσπαθούσε να επιστρέψει στην Ιθάκη;" ,
			  "Ποιος θεός φιλοτέχνησε την ασπίδα του Αχιλλέα; ", 
			  "Ποιος θεός οργίστηκε με τον Οδυσσέα και τους συντρόφους του, επειδή του έφαγαν τα ιερά του βόδια;",
			  "Πώς λεγόταν ο αοιδός του παλατιού του Οδυσσέα στην Ιθάκη;",
			  "Ποιο σκυλί ζήτησε ο Ευρυσθέας από τον Ηρακλή να του φέρει από τον Κάτω Κόσμο;",
			  "Πώς λεγόταν ο πατέρας  του Θησέα;","Πώς λεγόταν ο πρώτος Αχαιός πολεμιστής που σκοτώθηκε στην Τροία;",
			  "Ποια ήταν η αδερφή της Αντιγόνης;", "Πώς λεγόταν η σκλάβα του Αχιλλέα την οποία απαίτησε ο Αγαμέμνων να του την πάρει;",
			  "Ποιος ήταν ο Τιτάνας που τιμωρήθηκε από το Δία να φέρει αιώνια στους ώμους του τον ουράνιο θόλο;",
			  "Που ήταν κτισμένο το παλάτι του βασιλιά Μίνωα;","Σε πόσους συνολικά άθλους διακρίθηκε ο Θησέας;",
			  "Σύμφωνα με τον Ηρόδοτο, πότε έγινε ο Τρωικός Πόλεμος;",
			  "Σε ποιους είχε αναθέσει τη φύλαξη των ζώων του ο Γηρυόνης, ο άνθρωπος με τα τρία σώματα;",
			  "Ποια ήταν η βασίλισσα των θεών και των ανθρώπων;","Για ποιον λόγο οργανώθηκε από τον Ιάσονα η Αργοναυτική εκστρατεία",
			  "Πώς έμοιαζε στην όψη μία Χίμαιρα;","Σε ποιο μέρος έκρυψε η Ρέα, τον γιό της Δία προκειμένου να γλιτώσει από τον Κρόνο που έτρωγε τα παιδιά του;",
			  "Ποιο είναι το σύμβολο του θεού Ποσειδώνα ;", "Ποιος ήρθε «αντιμέτωπος» με τις Σειρήνες;",
			  
			 //same..
			 
			 /*1*/ "Σε ποιό βουνό έστειλε ο Ευρυσθέας  τον Ηρακλή για να βρει το αγριογούρουνο;",
			 /*2*/ "Πως λεγόταν ο αδερφός του Ηρακλή;",
			 /*3*/ "Ποιός ήταν ο πρώτος άθλος του Ήρακλη;",
			 /*4*/ "Πως λεγόταν η γυναίκα του Έκτορα;",
			 /*5*/ "Ποιος θεός ήταν με το μέρος των Αχαιών στον πόλεμο της Τροίας;",
			 /*6*/ "Πως λεγόταν ο γιός του Δαιδάλου;",
			 /*7*/ "Πως σκότωσε ο Ηρακλής το λιοντάρι της Νεμέας;",
			 /*8*/ "Από ποιο λιμάνι ξεκίνησαν οι Αχαιοί για την Τροία;",
			 /*9*/ "Πως λεγόταν το πλοίο με το οποίο ο Ιάσονας έφτασε στην Κολχίδα;",
			 /*10*/ "Πως λεγόταν ο σοφός βασιλίας της Πύλου που πήρε μέρος στον Τρωικό πόλεμο;",
			 
			 /*11*/ "Ποιος θεός είχε το προσωνύμιο ψυχοπομπός;",
			 /*12*/ "Ποιος κατέβηκε στον Άδη για να πάρει πίσω τη γυναίκα του, την Ευριδίκη;",
			 /*13*/ "Ο Δίας μεταμορφώθηκε σε κύκνο για να ενωθεί ερωτικά με την:",
			 /*14*/ "Ποιός έλυσε το γρίφο της Σφίγγας;",
			 /*15*/ "Η αδερφή του Απόλλωνα ήταν η:",
			 /*16*/ "Η Κίρκη μεταμόρφωσε τους συντρόφους του Οδυσσέα σε:",
			 /*17*/ "Ο θεός της μαντικής τέχνης ήταν ο:",
			 /*18*/ "Το πιστό σκυλί του Οδυσσέα λεγόταν:",
			 /*19*/ "Ο Αγαμέμνονας φονεύτηκε από τον:",
			 /*20*/ "Ο πατέρας του Δία ήταν ο:"
				 
			   };
	  
	    public void startQuestions(int n){
	      Question_check questions = new Question_check(qs[n],answers[n],0,this);
	      questions.playq();  
	        
	       
	    
	    }
}
